{
  "speakers": [
    {
        "id": "Erik-Bryn",
        "image":"ebryn.jpg",
        "name": "Erik Bryn",
        "from": "Prototypal",
        "twitter": "ebryn",
        "bio": "I build amazing things with JavaScript. Ember.js core team. Founder of @weareprototypal: Ember training & consulting from the experts.",
        "topic": "JavaScript Frameworks",
        "location": "Regency Ballroom",
        "time": "9:15 am",
        "day": "Monday",
        "title": "On the topic of Ember.",
        "details": "Coming Soon.",
        "fact": "core contributor to Ember"
    },
    {
        "id": "Martin-Gonto",
        "image":"mgonto.jpg",
        "name": "Martin Gonto",
        "from": "Auth0",
        "twitter": "mgonto",
        "bio": "Martin Gontovnikas has been a tech nerd since he was 12 years old. Now, he's a web developer, trainer, speaker and writer. He currently works as a Developer Advocate at Auth0.\nHe's a big advocate and contributor for Open Source software. He has built Restangular, angularytics, factory_pal, angular-jwt and many more!\nHe (not so) frequently blogs at http://gon.to/blog/ and has spoken at JSConf, ngConf and dotJS among others.",
        "topic": "JavaScript Frameworks",
        "location": "Regency Ballroom",
        "time": "9:40 am",
        "day": "Monday",
        "title": "Angular 2: The new horizon",
        "details": "Everything we used to know (and love?) from Angular 1 has died. No more $scope, services, factories and controllers. Is it good that they died? Why? In this talk, I'll answer those questions and we'll learn all of the key concepts of Angular 2 with a Live Coding demo! Be aware, this session isn't for those faint-hearted.",
        "fact": "creator of restangular"
    },
    {
        "id": "Pete-Hunt",
        "image":"floydophone.jpg",
        "name": "Pete Hunt",
        "from": "ReactJS",
        "twitter": "floydophone",
        "bio": " One of the original members of the React team, now working on a startup!",
        "topic": "JavaScript Frameworks",
        "location": "Regency Ballroom",
        "time": "10:05 am",
        "day": "Monday",
        "title": "Bring React to an existing app.",
        "details": "This talk will cover how we can embed jQuery plugins inside of a React app, and React apps inside of jQuery plugins",
        "fact": "core contributor to React"
    },
    {
        "id": "Zoltan-Olah",
        "image":"zqzoltan.jpg",
        "name": "Zoltan Olah",
        "from": "",
        "twitter": "zqzoltan",
        "bio": "Zoltan Olah is the lead architect and co-founder at Percolate Studio - a San Francisco digital agency specializing in frontend design/ux/engineering. The studio uses tools like Meteor, Famo.us, Nodejs and Swift to explore the leading edge and build captivating experiences for clients.",
        "topic": "Full Stack",
        "location": "Regency Ballroom",
        "time": "10:45 am",
        "day": "Monday",
        "title": "Demystifying Meteor.",
        "details": "Percolate Studio is Meteor’s earliest adopter. We’ve had the opportunity to deploy and scale countless productions applications for our clients. Along the way we’ve experienced and overcome many of the rough edges of a rapidly maturing framework.\n\nWhile the concepts fundamental to Meteor can be initially confusing, they’re incredibly powerful when mastered. In this talk, I’ll demystify the framework and show how we leverage Meteor to be more productive and deliver compelling realtime experiences.",
        "fact": "meteor expert"
    },
    {
        "id": "Jade-Wang",
        "image":"jade.jpg",
        "name": "Jade Wang",
        "from": "Sandstorm.io",
        "twitter": "qiqing",
        "bio": "Jade co-founded [Sandstorm.io](https://sandstorm.io/), an [open](http://lwn.net/Articles/603485/) [source](http://www.wired.com/2014/07/out-in-the-open-sandstorm-makes-it-easy-to-control-your-apps-in-the-cloud/) [platform](https://gigaom.com/2014/08/01/sandstorms-decentralized-hosting-platform-could-finally-make-indie-web-apps-viable/) for [personal servers](http://techcrunch.com/2014/08/05/sandstorm/), which recently raised [$1.3M in seed funding](https://gigaom.com/2015/01/15/personal-server-platform-sandstorm-gets-serious-with-1-3m-boost/) after a successful crowdfunding campaign. Previously, she created and led the developer engagement program for open source web framework Meteor, and [grew the community to over a hundred active meetup groups](http://www.heavybit.com/library/video/2014-07-08-jade-wang) in cities all over the world in just under 2 years. She also founded [Chez JJ](http://chezjj.com/), the network of [live-work communities](http://bits.blogs.nytimes.com/2012/07/06/untold-stories-from-hacker-hostels/) for [hackers, scientists](http://www.thewire.com/technology/2012/07/ah-where-real-silicon-valley-hackers-are/54247/), and [entrepreneurs](http://www.nytimes.com/2012/07/06/technology/at-hacker-hostels-living-on-the-cheap-and-dreaming-of-digital-glory.html).",
        "topic": "Full Stack",
        "location": "Regency Ballroom",
        "time": "11:10 am",
        "day": "Monday",
        "title": "Sandstorm.io: one-click, deploy anywhere.",
        "details": "Ever wanted to try out an open source app but didn't want to spend an afternoon messing with config files? Made an internal app for your team? Or a hobby side project? It can be as easy to deploy as installing an app on your phone. In this session, I will live demo how to package a Meteor app for one-click deployment using Sandstorm.io, as well as how to make your app available to end users in the App Market.\n\nDemo: https://demo.sandstorm.io",
        "fact": "co-founder of Sandstorm.io"
    },
    {       
        "id": "Emily-Stark",
        "image":"estark37.jpg",
        "name": "Emily Stark",
        "from": "Google",
        "twitter": "estark37",
        "bio": "Emily is a software engineer on the Google Chrome security team, where she focuses on efforts to make TLS/SSL more usable and secure. Previously, she was a core developer at Meteor Development Group, where she worked on web framework security and internal infrastructure, and a graduate student researching client-side cryptography in web browsers.\n\nEmily has a master's degree from MIT and a bachelor's degree from Stanford, both in computer science.",
        "topic": "Full Stack",
        "location": "Regency Ballroom",
        "time": "11:35 am",
        "day": "Monday",
        "title": "https://<your site here>",
        "details": "2015 is the year of TLS on the web. In this talk I'll explain why you should run a secure site (even if you think you don't need to or can't afford to) and how to get set up with TLS. I'll go over common TLS configuration pitfalls and how to avoid them, as well as some new cutting-edge features that you can use to provide a secure experience for your users.",
        "fact": "security expert"
    },
    {
        "id": "Amanda-Glosson",
        "image":"amanda.jpg",
        "name": "Amanda Glosson",
        "from": "Salesforce",
        "twitter": "amandaglosson",
        "bio": " Amanda loves pixels and has been pushing them around screens for over 10 years. Most recently, she's been found pushing them around as a front-end developer at Salesforce.",
        "topic":"Empathy",
        "location":"Regency Ballroom",
        "time":"2:30 pm",
        "day":"Monday",
        "title": "Coding With Empathy:\nDevelopers Are People Too",
        "details": "Companies have entire usability teams focused on designing empathetic interfaces to present to their end users, but how can we as developers foster empathy for one another (and perhaps our future selves) through the code we write? In this talk, we will explore how coding, with a foundation rooted in empathy, can help us write robust, (re)usable software together.",
        "fact": "creator of eightbysixteen"
    },
    {
        "id": "John-Resig",
        "image":"john.jpg",
        "name": "John Resig",
        "from": "Kahn Academy",
        "twitter": "jeresig",
        "bio": "John Resig is a developer at Khan Academy and the creator of the jQuery JavaScript library. He’s also the author of the books Pro JavaScript Techniques and Secrets of the JavaScript Ninja.",
        "topic": "Empathy",
        "location": "Regency Ballroom",
        "time": "2:55 pm",
        "day": "Monday",
        "title": "On the topic of Developer Empathy",
        "details": "Coming Soon.",
        "fact": "creator of jQuery"
    },
    {
        "id": "Kelly-King",
        "image":"kelly.jpg",
        "name": "Kelly King",
        "from": "Twitter",
        "twitter": "kng",
        "bio": "I love designing and coding for the web. I currently live in San Francisco and work as a web developer at Twitter.",
        "topic": "Empathy",
        "location": "Regency Ballroom",
        "time": "3:20 pm",
        "day": "Monday",
        "title": "Experimentation and Emotional Design",
        "details": "Great design can be used to make websites more fun, make difficult tasks feel easier, and establish a long term connection with our users. However, it can be hard to know which playful changes will delight users, and which will drive them away. Let’s explore how we can use the power of experimentation frameworks and A/B testing to make sure we only ship successful changes. We’ll cover some examples of A/B tests, and discuss the potential drawbacks of relying on quantitative data, including the effect on our users and our product direction. Finally, we’ll look at the field of emotional design, and how we can use those insights to make better changes for our users.",
        "fact": "creator of bootstrapify"
    },
    {       
        "id": "Karo-Caran",
        "image":"karo.jpg",
        "name": "Karo Caran",
        "from": "",
        "twitter": "rainbowpoetess",
        "bio": "Karo is a champion of accessibility. She has a PhD in education, passion for poetry, and a recently discovered joy of learning JavaScript. ",
        "topic": "Accessibility",
        "location": "Regency Ballroom",
        "time": "4:00 pm",
        "day": "Monday",
        "title": "A Partially Sighted User's Perspective on Navigating the Digital Landscape.",
        "details": "Karo will share the dos and don'ts of web and mobile visual design from the user experience of someone who is partially sighted. She will show how she browses the web/navigates the mobile environment and break some stereotypes associated with designing for users with low vision.  She will discuss good/bad practices and provide feedback on how the more challenging interactions could be improved.",
        "fact": "accessibility expert"
    },
    {       
        "id": "Jon-Kuperman",
        "image":"jkup.jpg",
        "name": "Jon Kuperman",
        "from": "twitter",
        "twitter": "jkup",
        "bio": "Jon works as a software engineer at Twitter. He is passionate about functional JavaScript and building accessible web applications.",
        "topic": "Accessibility",
        "location": "Regency Ballroom",
        "time": "4:25 pm",
        "day": "Monday",
        "title": "From Developer to A11y",
        "details": "Let's talk about Accessibility (a11y) from a developer's point of view. Jon will share his experience entering the world of web accessibility. Then he will talk about the great resources, must read posts and the incredible tools available to make and test accessible web applications.",
        "fact": "accessibility expert"
    },
    {       
        "id": "Victor-Tsaran",
        "image":"victor.jpg",
        "name": "Victor Tsaran",
        "from": "",
        "twitter": "vick08",
        "bio": "Victor is a UX,accessibility, jazz and acoustic guitar dude. Loves reading literature and other people's minds! He's making Social and other stuff accessible!",
        "topic": "Accessibility",
        "location": "Regency Ballroom",
        "time": "4:50 pm",
        "day": "Monday",
        "title": "The Modern Web and Accessibility.",
        "details": "Victor will discuss the fundamentals of developing modern web apps that are both accessible and usable. As part of his talk, Victor will cover ARIA (Accessible Rich Internet Applications) spec, its most useful aspects for web developers, and practical benefit to users of assistive technology.",
        "fact": "accessibility expert"
    },
    {
        "id": "Ariya-Hidayat",
        "image":"ariya.jpg",
        "name": "Ariya Hidayat",
        "from": "Shape Security",
        "twitter": "AriyaHidayat",
        "bio": "My name is Ariya Hidayat. I live in Mountain View, California.  These days, I promote software craftsmanship, JavaScript, HTML5, CSS3, and general web technologies. I also write fairly regularly (select posts) and speak at developer events (list of talks) from time to time.",
        "topic": "AST / Build",
        "location": "Regency Ballroom",
        "time": "9:15 am",
        "day": "Tuesday",
        "title": "JavaScript Syntax Tree Demystified",
        "details": "The structure of any valid JavaScript program can be represented by a syntax tree. In this talk, we will cover the basics of syntax parsing process using Esprima and the popular abstract syntax tree format ESTree. Among other benefits, such a syntax tree can be used to perform any syntactical analysis on the code. This talk will continue to cover the use of Esprima in JSCS, a popular tool to check and enforce coding style for JavaScript program.",
        "fact": "creator of esprima"
    },
    {
        "id": "Mike-Sherov",
        "secondary": true,
        "image":"mike.jpg",
        "name": "Mike Sherov",
        "from": "Behance",
        "twitter": "mikesherov",
        "bio": "Mike is a Senior Software Engineer at [Behance](http://blog.behance.net/dev), from Plainview, New York. Mike is involved in bug fixing, testing, and code quality efforts across the jquery suite of projects. He focuses his efforts around the CSS/JS interactions and interacts with standards bodies and browser vendors to move the web forward.",
        "topic": "AST / Build",
        "location": "Regency Ballroom",
        "time": "9:15 am",
        "day": "Tuesday",
        "title": "JavaScript Syntax Tree Demystified",
        "details": "The structure of any valid JavaScript program can be represented by a syntax tree. In this talk, we will cover the basics of syntax parsing process using Esprima and the popular abstract syntax tree format ESTree. Among other benefits, such a syntax tree can be used to perform any syntactical analysis on the code. This talk will continue to cover the use of Esprima in JSCS, a popular tool to check and enforce coding style for JavaScript program.",
        "fact": "core contributor to JSCS"
    },
    {
        "id": "substack",
        "image":"substack.png",
        "name": "James Halliday",
        "from": "modules inc.",
        "twitter": "substack",
        "bio": "I write a lot of small javascript packages. Beep boop.",
        "topic": "AST / Build",
        "location": "Regency Ballroom",
        "time": "9:40 am",
        "day": "Tuesday",
        "title": "What can you do with an AST? A whole lot.",
        "details": "Most of the things you can do are terrible hacks but sometimes there is no other way. This talk will cover some applications of ASTs to solve problems when there is no other way. \nModules covered:\n\n* browserify\n* falafel\n* coverify\n* insert-module-globals\n* static-module\n* brfs\n* glslify\n* static-eval\n* live-patch",
        "fact": "creator of browserify"
    },
    {
        "id": "James-Kyle",
        "image":"james.png",
        "name": "James Kyle",
        "from": "CloudFlare",
        "twitter": "thejameskyle",
        "bio": "James is an JavaScript engineer at CloudFlare and a contributor to several open source projects including Babel and Marionette. He's worked as a front end engineer at various startups over the last few years. In his free time he enjoys attending music and comedy shows. James also enjoys making artwork, whether in be sketching in notebooks or photoshop battles on reddit.",
        "topic": "AST / Build",
        "location": "Regency Ballroom",
        "time": "10:05 am",
        "day": "Tuesday",
        "title": "Compiling JavaScript",
        "details": "Babel is a compiler for writing next generation JavaScript. Internally it is broken down into a series of transforms that implement new language features. However, while building these transforms, Babel became a really good tool for building transforms. Now, Babel is also a platform for writing next generation tooling.",
        "fact": "core contributor to babel"
    },
    {
        "id": "Lin-Clark",
        "image":"lin.jpg",
        "name": "Lin Clark",
        "from": "npm",
        "twitter": "linclark",
        "bio": "Dev Star @npmjs. Developer/communicator/OSS contributor doing things with JS",
        "topic": "AST / Build",
        "location": "Regency Ballroom",
        "time": "10:30 am",
        "day": "Tuesday",
        "title": "Putting it all together",
        "details": "Using a variety of tools including Browserify, Babel, jQuery, and npm we are going to build a reusable widget!",
        "fact": "dev* at npm"
    },
    {
        "id": "Jason-Laster",
        "image":"jason.jpg",
        "name": "Jason Laster",
        "from": "Etsy",
        "twitter": "jasonlaster11",
        "bio": "I love building beautiful applications that delight users and developer tools that help make the process more enjoyable.",
        "topic": "Browser Developer Tools",
        "location": "Regency Ballroom",
        "time": "11:10 am",
        "day": "Tuesday",
        "title": "Chrome Developer Tools under the Magnifying Glass",
        "details": "Browser Developer Tools are a great way to inspect web applications. But how do they work? And how can you build an Inspector for your own App or Framework?\n\nIt turns out that Browser Developer Tools are web applications written in HTML, CSS, and JS and if you know how to build a website you can understand how they work. In this talk, we’ll explore the inner workings of Chrome's Developer Tools and several of the popular framework Inspectors.\n\nAlong the way, we’ll touch on some of DevTools’ hidden power features and by the end, you’ll be able to launch your editor and hack on your favorite DevTools!",
        "fact": "marionettejs contributor"
    },
    {
        "id": "Rey-Bango",
        "image":"rey.jpg",
        "name": "Rey Bango",
        "from": "Microsoft",
        "twitter": "reybango",
        "bio": "Rey is a lover of the web and an advocate for web standards. At Microsoft, he’s focused on helping developers build awesome cross-browser experiences and being a feedback conduit for the community. He’s privileged to be an original member of the jQuery Project Team.",
        "topic": "Browser Developer Tools",
        "location": "Regency Ballroom",
        "time": "11:35 am",
        "day": "Monday",
        "title": "Woah, You Can Test IE & Microsoft Edge on a Mac & Linux?",
        "details": "OS X and Linux are two very popular operating system choices for web developers but they still want to be able to test Internet Explorer and the new Microsoft Edge browsers. In this talk, we'll discuss the state of browser marketshare, the options available for testing these browsers on OS X & Linux and new tools that offer enhanced testing capabilities for mobile browsers.",
        "fact": "Microsoft Dev Advocate"
    },
    {       
        "id": "Sarah-Frisk",
        "image":"sarah.jpg",
        "name": "Sarah Frisk",
        "from": "Portland Webworks",
        "twitter": "sarahfrisk",
        "bio": "Sarah is a software developer, comic artist, Project Lead for jQuery Foundation’s Chassis project, and indie game dev enthusiast. She has two comics, Monster Markup Manual and Tavern Wenches.",
        "topic": "CSS",
        "location": "Regency Ballroom",
        "time": "2:30 pm",
        "day": "Tuesday",
        "title": "Chassis: The CSS Awakens - Best Practices While Building a CSS Framework.",
        "details": "JavaScript frameworks are here to stay. Where there once was a clear divide between server side logic and the mostly static front end, we’re now seeing more application logic finding its way to the client side. Traditional backend developers have found themselves not only coding application logic in JavaScript, but having to deal with HTML and CSS as well.  \n\nTo avoid dealing with HTML or CSS too closely, developers often turn to a CSS framework. Unfortunately, this approach comes with its own set of issues including obvious templating and opinionated/bloated markup that is enforced by the cascading part of CSS. While this can be useful in prototyping an application, it can make it difficult to restyle and rebrand later. Changing the markup doesn’t help either, because that can end up breaking JavaScript functionality.\n\nThis talk covers the lessons learned and best practices established while building Chassis, the new CSS framework coming from the jQuery Foundation. Developed by a group of JavaScript and CSS experts from both the  jQuery Foundation and around the web, Chassis endeavours to make front end development easier for both the people writing the application logic and those who are styling it. With a focus on standards, performance, accessibility, flexibility, and modularity, Chassis seeks to break the mold for how we look at integrating CSS into our projects.",
        "fact": "project lead chassis CSS"
    },
    {       
        "id": "Mark-Otto",
        "image":"mdo.jpg",
        "name": "Mark Otto",
        "from": "Github",
        "twitter": "mdo",
        "bio": "Mark is co-creator of Bootstrap and works at GitHub. He once designed Britney Spears’ website, plays a lot of Destiny, and is a huge nerd.",
        "topic": "CSS",
        "location": "Regency Ballroom",
        "time": "3:05 pm",
        "day": "Tuesday",
        "title": "@mdo-ular CSS",
        "details": "Much of the discussion around CSS has focused on immutable rules just for writing CSS classes, but this spotlight feels rather shortsighted. Instead, let’s talk about writing better CSS with fewer, more flexible guidelines that help put the focus on what’s between the curly braces.",
        "fact": "co-creator of bootstrap"
    },
    {       
        "id": "Brandon-Arnold",
        "image":"brandon.jpg",
        "name": "Brandon Arnold",
        "from": "Zurb Foundation",
        "twitter": "brandon_arnold",
        "bio": "Designer. Developer. Advertiser. Improviser. Spends days building Foundation with @ZURB & Nights with @CSzSanJose & @The_Roughhouse",
        "topic": "CSS",
        "location": "Regency Ballroom",
        "time": "3:30 pm",
        "day": "Tuesday",
        "title": "On the topic of Zurb Foundation",
        "details": "Coming Soon.",
        "fact": "zurb foundation lead"
    },
    {
        "id": "Yan",
        "image":"bcrypt.jpg",
        "name": "Yan",
        "from": "A Big Company",
        "twitter": "bcrypt",
        "bio": "I'm a Security Engineer at Yahoo, a Technology Fellow at EFF, and a member of the W3C Technical Architecture Group. I'm also a core developer of several open source projects like HTTPS Everywhere, Let's Encrypt, and SecureDrop.",
        "topic": "Wildcard",
        "location": "Regency Ballroom",
        "time": "4:10 pm",
        "day": "Tuesday",
        "title": "Building Standards for Better Web Security",
        "details": "Even in 2015, most web apps are vulnerable to well-known attacks like cross-site scripting, cookie hijacking, SQL injection, and password phishing. How will we keep users safe in the future? This talk is about new web features from the W3C that you can (or will soon be able to) use to make your awesome website more secure.",
        "fact": "w3c tag member"
    },
    {
        "id": "John-David-Dalton",
        "image":"jdd.jpg",
        "name": "John-David Dalton",
        "from": "Microsoft",
        "twitter": "jdalton",
        "bio": "A JavaScript tinkerer, bug fixer, & benchmark runner. Microsoft Edge Web Apps & Frameworks Ecosystem Program Manager @Microsoft. Opinions are my own.",
        "topic": "Wildcard",
        "location": "Regency Ballroom",
        "time": "4:35 pm",
        "day": "Tuesday",
        "title": "You do what with Continuous Integration? Or maybe something else!",
        "details": "Coming Soon.",
        "fact": "creator of lodash"
    },
    {       
        "id": "John-Brown",
        "image":"thisisjohnbrown.jpg",
        "name": "John Brown",
        "from": "Instrumental",
        "twitter": "ThisIsJohnBrown",
        "bio": "(function(a) {\n\tvar b = a.split(‘’);\n\tfor (var i = b.length - 1; i >= 0; i—) {\n\t\tvar c = b[i].charCodeAt(0) - 65;\n\t\tc = (c - (4 + i % 6)) % 65;\n\t\tb[i] = (String.fromCharCode(c + 65));\n\t}\n\treturn b.join(‘’);\n})();",
        "topic": "Wildcard",
        "location": "Regency Ballroom",
        "time": "5:00 pm",
        "day": "Tuesday",
        "title": "State of the Art",
        "details": "Ben Purdy and John Brown have worked together on a wide range of physical/digital interactive projects from client work to gallery shows. They’re they’ll be talking about their autonomous Twitter bots, stand-alone physical games that exist in the wild but communicate with web, tools created for real-time performances, and even a Nintendo autonomously controlled via Raspberry Pi, all built with Node or running in a browser. They will discuss the triumphs and failures of their work, and how JavaScript has fit into the ever-expanding list of tools for these unusual undertakings.",
        "fact": "swiss army developer"
    },
    {       
        "id": "Ben-Purdy",
        "secondary": true,
        "image": "ben.png",
        "name": "Ben Purdy",
        "from": "Instrumental",
        "twitter": "purdybot",
        "bio": "fjt’x~vi ‘iwh%pvpw$gxv w$fxl(lsqrhjxvfzvz|0%iymjxntn(jvy&hvm$j~wm{mjtjm|$nt’|qi%vo |mhgs(|tfil6)xmkpz)s{kyiup%vhz}rjxzprt%ihv)fjy{(ki%y|uvii&|x)f~&imw$fy’|qi%iswjo%}p|q$ouov)ex&{pn$ignonv3&pv)xmkpz)i}vlzrqjt{i}mttz4)ntnu(rw%zom)wfr{4){mosm)fjt’q|$ynl(yiuvlz7$|nlv)my&jwvix&{w)xmk’i{xny{ql$xokm5$gku(rw%zom)jnrsqwk1&hvm$ouov)mx&{pn$yuy|rpqg’{qiqr’0}lj&{wveyul{)esj’tnxy{jm)ewk’r~wy&{pnvj&mw{$xnv 22%hlv)tzxk )mx&{pn$uxpvlmugs(jx%msw€ft~3(jri&qwqr%hyw€r%oz(j$ykjpwmhgs(mmwkj|xv%g{(rrxzy}visz5",
        "topic": "Wildcard",
        "location": "Regency Ballroom",
        "time": "5:00 pm",
        "day": "Tuesday",
        "title": "State of the Art",
        "details": "Ben Purdy and John Brown have worked together on a wide range of physical/digital interactive projects from client work to gallery shows. They’re they’ll be talking about their autonomous Twitter bots, stand-alone physical games that exist in the wild but communicate with web, tools created for real-time performances, and even a Nintendo autonomously controlled via Raspberry Pi, all built with Node or running in a browser. They will discuss the triumphs and failures of their work, and how JavaScript has fit into the ever-expanding list of tools for these unusual undertakings.",
        "fact": "swiss army developer"
    },
    {
        "id": "Mikeal-Rogers",
        "image":"mikeal.png",
        "name": "Mikeal Rogers",
        "from": "Modulus",
        "twitter": "Mikeal",
        "bio": "JS Community Organizer. Creator/Curator of NodeConf & JSFest. Evangelist at Modulus.",
        "topic": "Wildcard",
        "location": "Regency Ballroom",
        "time": "5:25 pm",
        "day": "Tuesday",
        "title": "On the merging of node and io",
        "details": "Coming Soon.",
        "fact": "pronounced Michael"
    }
  ]
}